#Написати скрипт, який залишить в словнику тільки пари із унікальними #значеннями (дублікати значень - видалити). Словник для
#   роботи захардкодити свій.
#                Приклад словника (не використовувати):
#                {'a': 1, 'b': 3, 'c': 1, 'd': 5}
#                Очікуваний результат:
#                {'a': 1, 'b': 3, 'd': 5}

list1 = {1: 1, 2: 2,  2: 2, 'test': 4}

values = set()
new_list = {}

    for k, v in list1.items():
        if k not in values:
        new_list.update({k: v})
        values.add(k)
print(new_list)

