#1. Програма-світлофор.
#   Створити програму-емулятор світлофора для авто і пішоходів.
#   Після запуска програми на екран виводиться в лівій половині - колір 
#автомобільного, а в правій - пішохідного світлофора.
#   Кожну секунду виводиться поточні кольори. Через декілька ітерацій - 
#відбувається зміна кольорів - логіка така сама як і в звичайних світлофорах.
#   Приблизний результат роботи наступний:

import time

while True:
    for i in range(4):
        time.sleep(1)
        print("Red         Green")
    for i in range(2):
        time.sleep(1)
        print("Yellow      Green") 
    for i in range(4):
        time.sleep(1)
        print("Green       Red")
    for i in range(2):
        time.sleep(1)
        print("Yellow      Red")