#2. Створіть функцію для валідації пари ім'я/пароль за наступними правилами:
#   - ім'я повинно бути не меншим за 3 символа і не більшим за 50;
#   - пароль повинен бути не меншим за 8 символів і повинен мати хоча б одну 
#цифру;
#   - щось своє :)
#   Якщо якийсь із параментів не відповідає вимогам - породити виключення із 
#відповідним текстом.

login = input()
password = input()

def is_valid(login, password):
    if len(login) < 3 or len(login) > 50:
        raise 'Имя пользователя должно содержать 3-50 символов.'
    for i in login:
        if i in '0123456789':
            raise 'Имя не должно содержать цифры'
    if len(password) < 8:
        raise 'Пароль содержит меньше 8 символов.'
    for i in password:
        if i in '0123456789':
            break
    else:
        raise 'Пароль должен содержать хотябы одну цифру.'

print(is_valid(login, password))
