#2. Написати функцію < bank > , яка працює за наступною логікою: користувач 
#робить вклад у розмірі < a > одиниць строком на < years > років під 
#< percents > відсотків (кожен рік сума вкладу збільшується на цей відсоток, 
#ці гроші додаються до суми вкладу і в наступному році на них також 
#нараховуються відсотки). Параметр < percents > є необов'язковим і має 
#значення по замовчуванню < 10 > (10%). Функція повинна принтануть і вернуть 
#суму, яка буде на рахунку.
deposit = int(input('Введите сумму вклада: '))
years = int(input('Введите количество лет: '))

def bank(deposit, years, percents = 10):
	for i in range (1, years + 1):
		deposit = deposit * (1 + percents / 100)
	return deposit

result = bank(deposit, years)
result1 = round(result, 2)

if deposit > 0 and years > 0:
	print(result1)
else:
	print('Сумма/год должны быть больше 0. Введите корректные данные.')